<?php
/**
 * @link http://www.yiiframework.com/
 * @copyright Copyright (c) 2008 Yii Software LLC
 * @license http://www.yiiframework.com/license/
 */

namespace app\commands;

use yii\console\Controller;
use app\models\Country;
use app\models\City;

/**
 * This command echoes the first argument that you have entered.
 *
 * This command is provided as an example for you to learn how to create console commands.
 *
 * @author Qiang Xue <qiang.xue@gmail.com>
 * @since 2.0
 */
class SeedCountryCityController extends Controller
{
    /**
     * This command echoes what you have entered as the message.
     * @param string $message the message to be echoed.
     */
    protected function cyrillicToLatin($text, $toLowCase = TRUE)
    {
        $matrix=array(
                "й"=>"i","ц"=>"c","у"=>"u","к"=>"k","е"=>"e","н"=>"n",
                "г"=>"g","ш"=>"sh","щ"=>"shch","з"=>"z","х"=>"h","ъ"=>"",
                "ф"=>"f","ы"=>"y","в"=>"v","а"=>"a","п"=>"p","р"=>"r",
                "о"=>"o","л"=>"l","д"=>"d","ж"=>"zh","э"=>"e","ё"=>"e",
                "я"=>"ya","ч"=>"ch","с"=>"s","м"=>"m","и"=>"i","т"=>"t",
                "ь"=>"","б"=>"b","ю"=>"yu",
                "Й"=>"I","Ц"=>"C","У"=>"U","К"=>"K","Е"=>"E","Н"=>"N",
                "Г"=>"G","Ш"=>"SH","Щ"=>"SHCH","З"=>"Z","Х"=>"X","Ъ"=>"",
                "Ф"=>"F","Ы"=>"Y","В"=>"V","А"=>"A","П"=>"P","Р"=>"R",
                "О"=>"O","Л"=>"L","Д"=>"D","Ж"=>"ZH","Э"=>"E","Ё"=>"E",
                "Я"=>"YA","Ч"=>"CH","С"=>"S","М"=>"M","И"=>"I","Т"=>"T",
                "Ь"=>"","Б"=>"B","Ю"=>"YU",
                "«"=>"","»"=>""," "=>"-",
                "\""=>"", "\."=>"", "–"=>"-", "\,"=>"", "\("=>"", "\)"=>"",
                "\?"=>"", "\!"=>"", "\:"=>"",
                '#' => '', '№' => '',' - '=>'-', '/'=>'-', '  '=>'-',
        );
        foreach($matrix as $from=>$to)
            $text=mb_eregi_replace($from,$to,$text); 

        return $text;
    }

    public function actionIndex()
    {
        $countries_and_cities = [['КНР' ,'Шанхай,Пекин,Гуанчжоу,Харбин,Гонконг,Шэньчжэнь,Чунцин,Урумчи,Ухань,Ланьчжоу,Баотоу,Синин,Хэфэй,Гуйян,Шэньян,Далянь,Ляньюньган,Фучжоу,Сямынь,Хуанши,Чанша,Шаоян,Шицзячжуан,Таншань,Циньхуандао,Ханьдань,Чэндэ,Чжанцзякоу,Дацин,Хэган,Цзямусы,Цицикар,Чжэнчжоу,Аньян,Кайфэн,Пуян,Наньян,Пиндиншань,Лоян,Синьсян,Синьян,Гирин,Чанчунь,Наньчан,Нанкин,Уси,Чанчжоу,Сучжоу,Янчжоу,Янчэн,Сюйчжоу,Тайчжоу,Вэньчжоу,Нинбо,Ханчжоу,Цзинань,Циндао,Жичжао,Тайань,Яньтай,Цзыбо,Тайюань,Датун,Линьфынь,Сиань,Хуайань,Суцянь,Лицзян,Куньмин,Хух-Хото,Лючжоу,Наньнин,Тяньцзинь,Фуян,Иян,Юэян,Хайкоу,Хуайбэй,Хуайнань,Шаогуань,Фошань,Дунгуань,Шаньтоу,Чжаньцзян,Чжуншань,Чжухай,Инкоу,Ляоян,Фусинь,Фушунь,Бэньси,Аньшань,Гуанъюань,Наньчун,Чэньчжоу,Чэнду,Дэян,Цзыгун,Паньчжихуа,Эчжоу,Ичан,Мяньян,Линьи,Чжэньцзян,Ибинь,Уху,Вэйфан,Баодин,Баоцзи,Хэцзэ,Шанжао,Дунъин,Ляочэн,Бочжоу,Хэнъян,Путянь'],['Индия' ,'Мумбай,Дели,Калькутта,Ченнай,Бангалор,Хайдарабад,Ахмадабад,Пуна,Сурат,Джайпур,Канпур,Лакхнау,Нагпур,Газиабад,Индаур,Коямпуттур,Кочин,Патна,Каликут,Бхопал,Триссур,Вадодара,Агра,Вишакхапатнам,Малаппурам,Тируванантапурам,Каннур,Лудхияна,Нашик,Виджаявада,Мадурай,Варанаси,Мирут,Фаридабад,Раджкот,Джамшедпур,Сринагар,Джабалпур,Асансол,Васаи-Вирар,Аллахабад,Дханбад,Кальян,Аурангабад,Амритсар,Джодхпур,Ранчи,Райпур,Коллам,Гвалиор,Бхилаи,Чандигарх,Тируччираппалли,Кота'],['Бразилия' ,'Сан-Паулу,Рио-де-Жанейро,Салвадор,Бразилиа,Форталеза,Белу-Оризонти,Манаус,Куритиба,Ресифи,Порту-Алегри,Белен,Гояния,Гуарульюс,Кампинас,Сан-Луис,Сан-Гонсалу,Масейо'],['Россия' ,'Москва,Санкт-Петербург,Новосибирск,Екатеринбург,Нижний Новгород,Самара,Казань,Омск,Челябинск,Уфа,Ростов-на-Дону,Красноярск,Волгоград,Пермь,Воронеж'],['Индонезия' ,'Джакарта,Сурабая,Бандунг,Бекаси,Медан,Тангеранг,Депок,Семаранг,Палембанг,Тангеранг-Селатан,Макасар,Батам,Пеканбару,Богор'],['Япония' ,'Токио,Йокогама,Осака,Нагоя,Саппоро,Кобе,Киото,Фукуока,Кавасаки,Сайтама,Хиросима,Сэндай'],['Нигерия' ,'Лагос,Кано,Ибадан' ,'Бенин-Сити,Порт-Харкорт,Кадуна,Аба,Абуджа,Майдугури,Илорин,Варри'],['Мексика' ,'Мехико,Гвадалахара,Монтеррей,Пуэбла-де-Сарагоса,Чиуауа,Сьюдад-Хуарес,Тихуана,Леон,Несауалькойотль,Сапопан'],['Республика Корея' ,'Сеул,Пусан,Инчхон,Тэгу,Тэджон,Кванджу,Чханвон,Сувон,Ульсан,Соннам'],['США' ,'Нью-Йорк,Лос-Анджелес,Чикаго,Хьюстон,Финикс,Филадельфия,Сан-Антонио,Даллас,Сан-Диего'],['Пакистан' ,'Карачи,Лахор,Фейсалабад,Равалпинди,Хайдарабад,Мултан,Гуджранвала,Пешавар,Исламабад'],['Иран' ,'Тегеран,Мешхед,Кередж,Тебриз,Шираз,Исфахан,Кум,Ахваз'],['Турция' ,'Стамбул,Анкара,Измир,Бурса,Адана,Газиантеп'],['Австралия' ,'Сидней,Мельбурн,Брисбен,Перт,Аделаида'],['ЮАР' ,'Йоханнесбург,Кейптаун,Претория,Дурбан,Соуэто'],['Бангладеш' ,'Дакка,Читтагонг,Нараянгандж,Кхулна,Газипур'],['Египет' ,'Каир,Александрия,Гиза,Шубра-Эль-Хейма'],['Колумбия' ,'Богота,Барранкилья,Кали,Медельин'],['Венесуэла' ,'Каракас,Маракайбо,Валенсия,Баркисимето'],['Филиппины' ,'Манила,Кесон-Сити,Калукан,Давао'],['Саудовская Аравия' ,'Эр-Рияд,Джидда,Мекка,Медина'],['Германия' ,'Берлин,Мюнхен,Гамбург,Кёльн'],['Ирак' ,'Багдад,Мосул,Басра,Эрбиль'],['Демократическая Республика Конго' ,'Киншаса,Лубумбаши,Мбужи-Майи,Кананга'],['Марокко' ,'Касабланка,Рабат,Марракеш,Фес'],['Украина' ,'Киев,Харьков,Одесса'],['Аргентина' ,'Буэнос-Айрес,Кордова,Росарио'],['Вьетнам' ,'Ханой,Хошимин,Хайфон'],['Китайская Республика' ,'Тайбэй,Гаосюн,Тайчжун'],['Канада' ,'Торонто,Монреаль'],['Великобритания' ,'Лондон,Бирмингем'],['Испания' ,'Мадрид,Барселона'],['Италия' ,'Рим,Милан'],['Сирия' ,'Дамаск,Халеб'],['Эквадор' ,'Кито,Гуаякиль'],['Гана' ,'Аккра,Кумаси'],['Камерун' ,'Дуала,Яунде'],['Судан' ,'Хартум,Омдурман'],['Боливия' ,'Санта-Крус-де-ла-Сьерра,Эль-Альто'],['Мьянма' ,'Янгон,Мандалай'],['Кения' ,'Найроби'],['ОАЭ' ,'Дубай'],['Таиланд' ,'Бангкок'],['Сингапур' ,'Сингапур'],['Сербия' ,'Белград'],['Зимбабве' ,'Хараре'],['Йемен' ,'Сана'],['Мозамбик' ,'Мапуту'],['Австрия' ,'Вена'],['Либерия' ,'Монровия'],['Малайзия' ,'Куала-Лумпур'],['Гвинея' ,'Конакри'],['Новая Зеландия' ,'Окленд'],['Гондурас' ,'Тегусигальпа'],['Гватемала' ,'Гватемала'],['Кот-д’Ивуар' ,'Абиджан'],['Республика Конго' ,'Браззавиль'],['Никарагуа' ,'Манагуа'],['Камбоджа' ,'Пномпень'],['Уругвай' ,'Монтевидео'],['Буркина-Фасо' ,'Уагадугу'],['Болгария' ,'София'],['Ливан' ,'Бейрут'],['Мадагаскар' ,'Антананариву'],['Чили' ,'Сантьяго'],['Эфиопия' ,'Аддис-Абеба'],['Мали' ,'Бамако'],['Ангола' ,'Луанда'],['Гаити' ,'Порт-о-Пренс'],['Куба' ,'Гавана'],['Сомали' ,'Могадишо'],['Доминиканская республика' ,'Санто-Доминго'],['Сенегал' ,'Дакар'],['Перу' ,'Лима'],['Танзания' ,'Дар-эс-Салам'],['Замбия' ,'Лусака'],['Уганда' ,'Кампала'],['Ливия' ,'Триполи'],['Алжир' ,'Алжир'],['КНДР' ,'Пхеньян'],['Иордания' ,'Амман'],['Белоруссия' ,'Минск'],['Румыния' ,'Бухарест'],['Польша' ,'Варшава'],['Чехия' ,'Прага'],['Венгрия' ,'Будапешт'],['Греция' ,'Афины'],['Азербайджан' ,'Баку'],['Армения' ,'Ереван'],['Грузия' ,'Тбилиси'],['Афганистан' ,'Кабул'],['Узбекистан' ,'Ташкент'],['Казахстан' ,'Алма-Ата'],['Монголия' ,'Улан-Батор'],['Франция' ,'Париж']];
        foreach ($countries_and_cities as $country) {

            $newCountry = new Country();
            $newCountry->name = $country[0];
            $newCountry->save();
            $cities = explode(",", $country[1]); 
            echo $this->cyrillicToLatin($country[0])."\n";
            
            foreach ($cities as $city) {
                $newCity = new City();
                $newCity->name = $city;
                $newCity->country_id = $newCountry->id;
                $newCity->save();
                echo "      ".$this->cyrillicToLatin($city)."\n";
            }
        }
       /* $cities = [
            ['name' => 'Kiev'],
            ['name' => 'Kropivnitskij'],
            ['name' => 'Kharkov'],
            ['name' => 'Dnepr'],
        ];
        $names = [
            ['fio' => 'Pid O.A.', 'city_id' => 1],
            ['fio' => 'Retly J.F.', 'city_id' => 2],
            ['fio' => 'Harny L.P.', 'city_id' => 3],
            ['fio' => 'Larry K.L.', 'city_id' => 4],
            ['fio' => 'Guffy M.G.', 'city_id' => 3],
            ['fio' => 'Dolly B.F.', 'city_id' => 2],
        ];
        $phones = [
            ['name_id' => 1, 'number' => '54-54-5454'],
            ['name_id' => 1, 'number' => '684-54-874'],
            ['name_id' => 1, 'number' => '554-5454-5'],
            ['name_id' => 2, 'number' => '94-454-454'],
            ['name_id' => 2, 'number' => '625541-545'],
            ['name_id' => 3, 'number' => '874-542-54'],
            ['name_id' => 4, 'number' => '684-544-45'],
            ['name_id' => 5, 'number' => '984-4547-4'],
            ['name_id' => 5, 'number' => '85454-5845'],
            ['name_id' => 6, 'number' => '44-845-545'],
            ['name_id' => 6, 'number' => '8974-545-5'],
        ];
        foreach ($cities as $city) {
            $newCity = new City();
            $newCity->attributes = $city;
            $newCity->save();
        }
        echo "Cities loaded! \n";
        foreach ($names as $name) {
            $newName = new Name();
            $city = City::findOne([
                'name' => $cities[$name['city_id']-1]['name'],
            ]);
            if ($city !== NULL) {
                echo "Find ".$city->name."\n";
                $name['city_id'] = $city->id;
            }
            $newName->attributes = $name;
            $newName->save();
        }
        echo "Names loaded! \n";
        foreach ($phones as $phone) {
            $newPhone = new Phone();
            $name = Name::findOne([
                'fio' => $names[$phone['name_id']-1]['fio'],
            ]);
            if ($name !== NULL) {
                echo "Find ".$name->fio."\n";
                $phone['name_id'] = $name->id;
            }

            $newPhone->attributes = $phone;
            $newPhone->save();
        }
        echo "Phones loaded! \n";
        echo "===  Done  === \n";*/
    }
}
